#include "main.h"
#include "port.h"

#include "uart.h"


/*--------------------------------------------------------------
	InitUART()
	初始化UART
--------------------------------------------------------------*/
void InitUART()
	{
	AUXR1 &=0xbf ; 
	SCON=0x5a;
	TMOD=0x20;
	TH1=TL1=-(OSC_FREQ/12/32/BAUD);
	TR1=1;
	}

/*-----------------------------------------------------------
	SendData()
	发送一个字节，并等待发送结束
-----------------------------------------------------------*/

void SendData(unsigned char dat)
	{
	SBUF=dat;
	while(!TI);
	TI=0;	
	}

/*-----------------------------------------------------------
	void SendNByte()
	发送多个字节，
-----------------------------------------------------------*/
void SendNByte(unsigned char *buf, unsigned char len)
	{
	while(len--)
		{
		SendData(*buf++);
		}
	}

/*---------------------------------------------------
	end of file
----------------------------------------------------*/